app/Http/Controllers/Api/PlaceController.php

    public function regsrv(Request $request)
    {

        $srvkey = \Request::header('srvkey');
        if(empty($srvkey)){
            return response()->json(['code' => 500, 'msg' => '场所key错误', 'data' => null]);
        }
        $exists = DB::table('place')->where(['key'=>$srvkey])->exists();
---
select exists(select * from `place` where (`key` = '0J0FONCIJ0WO')) as `exists`

    public function qrysrvmsg(Request $request)
    {

        $srvkey = \Request::header('srvkey');
        if(empty($srvkey)){
            return response()->json(['code' => 500, 'msg' => '场所key错误', 'data' => null]);
        }
        $exists = DB::table('place')->where(['key'=>$srvkey])->exists();
---
select exists(select * from `place` where (`key` = 'SZGA8BOPZLBB')) as `exists`