app/Http/Controllers/Api/ProductAgentController.php

    public function login(Request $request)
    {
        $post = json_decode(file_get_contents("php://input"), true);
        if(empty($post['userno']) || empty($post['password'])){
            return response()->json(['code' => 1015, 'msg' => '账号或密码不能为空', 'data' => '',"success"=> false]);
        }
        $exist = DB::table('apiuser')->where(['userno'=>$post['userno'],'password'=>$post['password']])->exists();
        if(!$exist){
            return response()->json(['code' => 1015, 'msg' => '账号或密码错误', 'data' => '',"success"=> false]);
        }
        $token = str_random(60);
        DB::table('apiuser')->where(['userno'=>$post['userno'],'password'=>$post['password']])->update(['token'=>$token]);
---
select exists(select * from `apiuser` where (`userno` = 'companyManager' and `password` = 111111)) as `exists`
update `apiuser` set `token` = 'zgy0BNUCmudNihuMLR7ttGgS6H0Kr23Y5edm3BwEM7LzMNWjCiNCgegJe9TC' where (`userno` = 'companyManager' and `password` = 111111)

    public function agentupdate(Request $request)
    {
        // $exists = DB::table('agenttable')->get();
        // dd($exists);
        // Log::info(123);
        $token = \Request::header('Authorization');

        if(empty($token) || empty(Cache::get('productToken')) || !in_array($token,Cache::get('productToken'))){
            return response()->json(['code' => 1015, 'msg' => 'token无效', 'data' => '',"success"=> false]);
        }

        $post = json_decode(file_get_contents("php://input"), true);
        // Log::info($post);
        try{
            $data = ['agentid'=>$post['agentid'],'agentNo'=>$post['agentNo'],'agentName'=>$post['agentname'],
                    'country'=>$post['country'],'province_code'=>$post['provinceCode'],'city_code'=>$post['cityCode'],
                    'isappChanne'=>$post['isAppChannel'],'ChannelNo'=>$post['channelNo'],
                    'agentLevel'=>$post['agentLevel'], 'parentAgentid'=>$post['parentAgentid']];

            $exists = DB::table('agenttable')->where('agentid',$post['agentid'])->exists();

            // Log::info($data);
            if(!$exists){
                DB::table('agenttable')->insert($data);
            }else{
                DB::table('agenttable')->where('agentid',$post['agentid'])->update($data);
---
select exists(select * from `agenttable` where `agentid` = 56) as `exists`
insert into `agenttable` (`agentid`, `agentNo`, `agentName`, `country`, `province_code`, `city_code`, `isappChanne`, `ChannelNo`, `agentLevel`, `parentAgentid`) values (59, 'xiaji', 'xiaji', '中国', '410000', '410600', 0, '', 1, 56)
update `agenttable` set `agentid` = 56, `agentNo` = 'A0001', `agentName` = 'A0001', `country` = '中国', `province_code` = '440000', `city_code` = '440100', `isappChanne` = 1, `ChannelNo` = 'A0001', `agentLevel` = 1, `parentAgentid` = 0 where `agentid` = 56