app/Admin/Controllers/BoxRegisterController.php

select exists(select * from `settopbox` where `KtvBoxid` = '20200616') as `exists`
---
    protected function grid()
    {
        $grid = new Grid(new BoxRegister);

//        $grid->column('id', __('Id'));
        $grid->column('KtvBoxid', __('KtvBoxid'));
        $grid->column('machineCode', '机顶盒MAC');
        $grid->column('CreateDate', '生成时间');
        $grid->status('状态')->display(function () {
            $exists = DB::table('settopbox')->where('KtvBoxid',$this->KtvBoxid)->exists();
            if($exists){
                return '已注册';
            }
        });