app/Admin/Controllers/PlaceController.php

    protected function place()
    {
        Admin::script('place();');
        $grid = new Grid(new Place);
        $grid->setView('place.index');
        $grid->setName('place');

        $grid->disableColumnSelector();
//        $grid->disableExport();
//        $grid->disableCreateButton();

//        $grid->disableFilter(false);
        $grid->filter(function ($filter) {
            // 去掉默认的id过滤器
            $filter->disableIdFilter();
            // 在这里添加字段过滤器
            $filter->column(1 / 2, function ($filter) {
                $filter->like('key', 'key');
                $filter->like('placename', '场所名称');
                $wangMode = DB::table('warningmode')->pluck('warningName', 'id')->toArray();
---
select `warningName`, `id` from `warningmode`

        // });
        $grid->address('省市')->display(function () {

            // $province = $this->place->province;
            // if (!is_null($province)) {
            //     $province = DB::table('china_area')->where('code', $province)->value('name');
            // }
            // $city = $this->place->city;
            // if (!is_null($province)) {
            //     $city = DB::table('china_area')->where('code', $city)->value('name');
            // }
            return $this->place->province1->name . $this->place->city1->name;
            // return $province . $city;
        });
---
select * from `china_area` where `china_area`.`code` = '440000' and `china_area`.`code` is not null limit 1

        $warningCutcompanycounttime = 10;

        if (!empty($id)) {
            $place = DB::table('place')->where('id', $id)->first();
---
select * from `place` where `id` = '42' limit 1

        })->readonly();
        $form->number('boxPass', '机顶盒设置密码')->default('888888')->rules('required|regex:/^\d+$/', ['regex' => '必须全部为数字']);

        $wangMode = DB::table('warningmode')->pluck('warningName', 'id')->toArray();
---
select `warningName`, `id` from `warningmode`