app/Admin/Controllers/SetTopBoxController.php

        $Place_Royalty = $Agent_Royalty = $Obligee_Royalty = 0;
        $Place_Settlement = $Agent_Settlement = $Obligee_Settlement = 1;
        if(!empty($id)){
            $place = DB::table('settopbox')->where('id',$id)->first();
---
select * from `settopbox` where `id` = '288' limit 1