app/Http/Controllers/OrderController.php

select exists(select * from `place` where (`key` = 'SZGA8BOPZLBB')) as `exists`
select exists(select * from `settopbox` where (`key` = 'SZGA8BOPZLBB' and `KtvBoxid` = '201908240573')) as `exists`
---
    public function getQrCodeUrl()
    {

        $srvkey = \Request::header('srvkey');

        if(empty($srvkey)){
            return response()->json(['code' => 500, 'msg' => '场所key错误', 'data' => null]);
        }
        $exists = DB::table('place')->where(['key'=>$srvkey])->exists();
        if(!$exists){
            return response()->json(['code' => 500, 'msg' => 'key不存在', 'data' => null]);
        }

        $post = json_decode(file_get_contents("php://input"), true);

        $protocol = (!empty($_SERVER['HTTPS']) && $_SERVER['HTTPS'] !== 'off' || $_SERVER['SERVER_PORT'] == 443) ? "https://" : "http://";
        $domainName = $_SERVER['HTTP_HOST'];
//        if(!is_array($post)){
//            return response()->json(['code' => 500, 'msg' => 'post数据错误', 'data' => null]);
//        }
        foreach($post as $k=>$v){
            if(!empty($v['KtvBoxid'])){
                if(empty($v['KtvBoxid'])){
                    return response()->json(['code' => 500, 'msg'=>'机器码KtvBoxid错误','data'=>null]);
                }
                $exists = DB::table('settopbox')->where(['key'=>$srvkey,'KtvBoxid'=>$v['KtvBoxid']])->exists();